Revit 2024 API
MacroModule Properties
The MacroModule type exposes the following members.
Properties
Name | Description
Description
 The module description.
Environment
 The Macro environment.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MacroLanguageType
 The Macro language type.
MacroLevel
 The Macro level.
MacroManager
 The Macro manager.
ModuleStatus
 The module status.
Name
 The name of the module.
See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace